lkolbly/cmsis-svd/data/TexasInstruments/LM4F210H5QR.svd
        <register>
          <name>ICR</name>
          <description>UART Interrupt Clear</description>
          <addressOffset>0x00000044</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>UART_ICR_CTSMIC</name>
              <description>UART Clear to Send Modem Interrupt Clear</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_RXIC</name>
              <description>Receive Interrupt Clear</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_TXIC</name>
              <description>Transmit Interrupt Clear</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_RTIC</name>
              <description>Receive Time-Out Interrupt Clear</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_FEIC</name>
              <description>Framing Error Interrupt Clear</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_PEIC</name>
              <description>Parity Error Interrupt Clear</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_BEIC</name>
              <description>Break Error Interrupt Clear</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_OEIC</name>
              <description>Overrun Error Interrupt Clear</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_9BITIC</name>
              <description>9-Bit Mode Interrupt Clear</description>
              <bitRange>[12:12]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_LMSBIC</name>
              <description>LIN Mode Sync Break Interrupt Clear</description>
              <bitRange>[13:13]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_LME1IC</name>
              <description>LIN Mode Edge 1 Interrupt Clear</description>
              <bitRange>[14:14]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_LME5IC</name>
              <description>LIN Mode Edge 5 Interrupt Clear</description>
              <bitRange>[15:15]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL</name>
          <description>UART DMA Control</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>UART_DMACTL_RXDMAE</name>
              <description>Receive DMA Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UART_DMACTL_TXDMAE</name>
              <description>Transmit DMA Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UART_DMACTL_DMAERR</name>
              <description>DMA on Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCTL</name>
          <description>UART LIN Control</description>
          <addressOffset>0x00000090</addressOffset>
          <fields>
            <field>
              <name>UART_LCTL_MASTER</name>
              <description>LIN Master Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UART_LCTL_BLEN</name>
              <description>Sync Break Length</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART_LCTL_BLEN_13T</name>
                  <description>Sync break length is 13T bits (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_LCTL_BLEN_14T</name>
                  <description>Sync break length is 14T bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_LCTL_BLEN_15T</name>
                  <description>Sync break length is 15T bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_LCTL_BLEN_16T</name>
                  <description>Sync break length is 16T bits</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LSS</name>
          <description>UART LIN Snap Shot</description>
          <addressOffset>0x00000094</addressOffset>
          <fields>
            <field>
              <name>UART_LSS_TSS</name>
              <description>Timer Snap Shot</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LTIM</name>
          <description>UART LIN Timer</description>
          <addressOffset>0x00000098</addressOffset>
          <fields>
            <field>
              <name>UART_LTIM_TIMER</name>
              <description>Timer Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_9BITADDR</name>
          <description>UART 9-Bit Self Address</description>
          <addressOffset>0x000000A4</addressOffset>
          <fields>
            <field>
              <name>UART_9BITADDR_ADDR</name>
              <description>Self Address for 9-Bit Mode</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>UART_9BITADDR_9BITEN</name>
              <description>Enable 9-Bit Mode</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_9BITAMASK</name>
          <description>UART 9-Bit Self Address Mask</description>
          <addressOffset>0x000000A8</addressOffset>
          <fields>
            <field>
              <name>UART_9BITAMASK_MASK</name>
              <description>Self Address Mask for 9-Bit Mode</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>UART Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>UART_PP_SC</name>
              <description>Smart Card Support</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UART_PP_NB</name>
              <description>9-Bit Support</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <description>UART Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <fields>
            <field>
              <name>UART_CC_CS</name>
              <description>UART Baud Clock Source</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART_CC_CS_SYSCLK</name>
                  <description>The system clock (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_CC_CS_PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
