lkolbly/cmsis-svd/data/TexasInstruments/LM4F210H5QR.svd
        <register>
          <name>_2_GENB</name>
          <description>PWM2 Generator B Control</description>
          <addressOffset>0x000000E4</addressOffset>
          <fields>
            <field>
              <name>PWM_2_GENB_ACTZERO</name>
              <description>Action for Counter=0</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTZERO_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTZERO_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTZERO_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTZERO_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_2_GENB_ACTLOAD</name>
              <description>Action for Counter=Load</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTLOAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTLOAD_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTLOAD_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTLOAD_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_2_GENB_ACTCMPAU</name>
              <description>Action for Comparator A Up</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTCMPAU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTCMPAU_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTCMPAU_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTCMPAU_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_2_GENB_ACTCMPAD</name>
              <description>Action for Comparator A Down</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTCMPAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTCMPAD_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTCMPAD_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTCMPAD_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_2_GENB_ACTCMPBU</name>
              <description>Action for Comparator B Up</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTCMPBU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTCMPBU_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTCMPBU_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTCMPBU_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_2_GENB_ACTCMPBD</name>
              <description>Action for Comparator B Down</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTCMPBD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTCMPBD_INV</name>
                  <description>Invert the output signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTCMPBD_ZERO</name>
                  <description>Set the output signal to 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_2_GENB_ACTCMPBD_ONE</name>
                  <description>Set the output signal to 1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_DBCTL</name>
          <description>PWM2 Dead-Band Control</description>
          <addressOffset>0x000000E8</addressOffset>
          <fields>
            <field>
              <name>PWM_2_DBCTL_ENABLE</name>
              <description>Dead-Band Generator Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_DBRISE</name>
          <description>PWM2 Dead-Band Rising-Edge Delay</description>
          <addressOffset>0x000000EC</addressOffset>
          <fields>
            <field>
              <name>PWM_2_DBRISE_RISEDELAY</name>
              <description>Dead-Band Rise Delay</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_DBFALL</name>
          <description>PWM2 Dead-Band Falling-Edge-Delay</description>
          <addressOffset>0x000000F0</addressOffset>
          <fields>
            <field>
              <name>PWM_2_DBFALL_FALLDELAY</name>
              <description>Dead-Band Fall Delay</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_FLTSRC0</name>
          <description>PWM2 Fault Source 0</description>
          <addressOffset>0x000000F4</addressOffset>
          <fields>
            <field>
              <name>PWM_2_FLTSRC0_FAULT0</name>
              <description>Fault0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_2_FLTSRC0_FAULT1</name>
              <description>Fault1 Input</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_FLTSRC1</name>
          <description>PWM2 Fault Source 1</description>
          <addressOffset>0x000000F8</addressOffset>
          <fields>
            <field>
              <name>PWM_2_FLTSRC1_DCMP0</name>
              <description>Digital Comparator 0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_2_FLTSRC1_DCMP1</name>
              <description>Digital Comparator 1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_2_FLTSRC1_DCMP2</name>
              <description>Digital Comparator 2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_2_FLTSRC1_DCMP3</name>
              <description>Digital Comparator 3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_2_FLTSRC1_DCMP4</name>
              <description>Digital Comparator 4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_2_FLTSRC1_DCMP5</name>
              <description>Digital Comparator 5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PWM_2_FLTSRC1_DCMP6</name>
              <description>Digital Comparator 6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PWM_2_FLTSRC1_DCMP7</name>
              <description>Digital Comparator 7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_MINFLTPER</name>
          <description>PWM2 Minimum Fault Period</description>
          <addressOffset>0x000000FC</addressOffset>
          <fields>
            <field>
              <name>PWM_2_MINFLTPER_MFP</name>
              <description>Minimum Fault Period</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_CTL</name>
          <description>PWM3 Control</description>
          <addressOffset>0x00000100</addressOffset>
          <fields>
            <field>
              <name>PWM_3_CTL_ENABLE</name>
              <description>PWM Block Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_3_CTL_MODE</name>
              <description>Counter Mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_3_CTL_DEBUG</name>
              <description>Debug Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_3_CTL_LOADUPD</name>
              <description>Load Register Update Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_3_CTL_CMPAUPD</name>
              <description>Comparator A Update Mode</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_3_CTL_CMPBUPD</name>
              <description>Comparator B Update Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PWM_3_CTL_GENAUPD</name>
              <description>PWMnGENA Update Mode</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_3_CTL_GENAUPD_I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_CTL_GENAUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_CTL_GENAUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_3_CTL_GENBUPD</name>
              <description>PWMnGENB Update Mode</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_3_CTL_GENBUPD_I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_CTL_GENBUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_CTL_GENBUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_3_CTL_DBCTLUPD</name>
              <description>PWMnDBCTL Update Mode</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_3_CTL_DBCTLUPD_I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_CTL_DBCTLUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_CTL_DBCTLUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_3_CTL_DBRISEUPD</name>
              <description>PWMnDBRISE Update Mode</description>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_3_CTL_DBRISEUPD_I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_CTL_DBRISEUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_CTL_DBRISEUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_3_CTL_DBFALLUPD</name>
              <description>Specifies the update mode for the PWMnDBFALL register</description>
              <bitRange>[15:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_3_CTL_DBFALLUPD_I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_CTL_DBFALLUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_3_CTL_DBFALLUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_3_CTL_FLTSRC</name>
              <description>Fault Condition Source</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWM_3_CTL_MINFLTPER</name>
              <description>Minimum Fault Period</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>PWM_3_CTL_LATCH</name>
              <description>Latch Fault Input</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_INTEN</name>
          <description>PWM3 Interrupt and Trigger Enable</description>
          <addressOffset>0x00000104</addressOffset>
          <fields>
            <field>
              <name>PWM_3_INTEN_INTCNTZERO</name>
              <description>Interrupt for Counter=0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_3_INTEN_INTCNTLOAD</name>
              <description>Interrupt for Counter=Load</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_3_INTEN_INTCMPAU</name>
              <description>Interrupt for Counter=Comparator A Up</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_3_INTEN_INTCMPAD</name>
              <description>Interrupt for Counter=Comparator A Down</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_3_INTEN_INTCMPBU</name>
              <description>Interrupt for Counter=Comparator B Up</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_3_INTEN_INTCMPBD</name>
              <description>Interrupt for Counter=Comparator B Down</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PWM_3_INTEN_TRCNTZERO</name>
              <description>Trigger for Counter=0</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PWM_3_INTEN_TRCNTLOAD</name>
              <description>Trigger for Counter=Load</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PWM_3_INTEN_TRCMPAU</name>
              <description>Trigger for Counter=Comparator A Up</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PWM_3_INTEN_TRCMPAD</name>
              <description>Trigger for Counter=Comparator A Down</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PWM_3_INTEN_TRCMPBU</name>
              <description>Trigger for Counter=Comparator B Up</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PWM_3_INTEN_TRCMPBD</name>
              <description>Trigger for Counter=Comparator B Down</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_RIS</name>
          <description>PWM3 Raw Interrupt Status</description>
          <addressOffset>0x00000108</addressOffset>
          <fields>
            <field>
              <name>PWM_3_RIS_INTCNTZERO</name>
              <description>Counter=0 Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_3_RIS_INTCNTLOAD</name>
              <description>Counter=Load Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_3_RIS_INTCMPAU</name>
              <description>Comparator A Up Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_3_RIS_INTCMPAD</name>
              <description>Comparator A Down Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_3_RIS_INTCMPBU</name>
              <description>Comparator B Up Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_3_RIS_INTCMPBD</name>
              <description>Comparator B Down Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_ISC</name>
          <description>PWM3 Interrupt Status and Clear</description>
          <addressOffset>0x0000010C</addressOffset>
          <fields>
            <field>
              <name>PWM_3_ISC_INTCNTZERO</name>
              <description>Counter=0 Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_3_ISC_INTCNTLOAD</name>
              <description>Counter=Load Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_3_ISC_INTCMPAU</name>
              <description>Comparator A Up Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_3_ISC_INTCMPAD</name>
              <description>Comparator A Down Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_3_ISC_INTCMPBU</name>
              <description>Comparator B Up Interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_3_ISC_INTCMPBD</name>
              <description>Comparator B Down Interrupt</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_LOAD</name>
          <description>PWM3 Load</description>
          <addressOffset>0x00000110</addressOffset>
          <fields>
            <field>
              <name>PWM_3_LOAD_LOAD</name>
              <description>Counter Load Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
